; domain
(define (domain elevators)
    (:requirements :strips :typing :fluents) 
  (:types floor block movable - object
          elevator person - movable
          fast-elevator slow-elevator - elevator)
  
  (:predicates (at-floor ?m - movable ?f - floor)
               (at-elevator ?p - person ?l - elevator)
               (part-of ?e - elevator ?b - block)
               (serves ?e - elevator ?f - floor)
               )
  (:functions
           (elevator-capacity ?cap - elevator))

  (:action GET-IN
	   :parameters (?p - person ?e - elevator ?f - floor)
	   :precondition (and (at-floor ?p ?f)
 			              (at-floor ?e ?f)
 			              (> (elevator-capacity ?e) 0)
 			              )
	   :effect (and (at-elevator ?p ?e)
                    (not (at-floor ?p ?f))
                    (decrease (elevator-capacity ?e) 1)))

  (:action GET-OUT
	   :parameters (?p - person ?e - elevator ?f - floor)
	   :precondition (and (at-elevator ?p ?e)
 			              (at-floor ?e ?f)
 			              )
	   :effect (and (not (at-elevator ?p ?e))
                    (at-floor ?p ?f)
                    (increase (elevator-capacity ?e) 1)))

  (:action MOVE----------------------
	   :parameters (?e - elevator ?f1 - floor ?f2 - floor)
	   :precondition (and (serves ?e ?f1)
                          (serves ?e ?f2)
                          (at-floor ?e ?f1)
                          )
	   :effect (and (not (at-floor ?e ?f1))
                         (at-floor ?e ?f2)))
)

; problem
(define (problem p01) (:domain elevators)
  (:objects p0 p1 p2 p3 p4 - person
            f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 - floor
            slow-elev1 slow-elev2 slow-elev3 - slow-elevator
            fast-elev - fast-elevator
            b1 b2 b3 - block
            )
  (:init
       (at-floor p0 f2)
       (at-floor p1 f4)
       (at-floor p2 f1)
       (at-floor p3 f8)
       (at-floor p4 f1)
       (= (elevator-capacity slow-elev1) 2)
       (= (elevator-capacity slow-elev2) 2)
       (= (elevator-capacity slow-elev3) 2)
       (= (elevator-capacity fast-elev) 3)
       
       (serves slow-elev1 f0)
       (serves slow-elev1 f1)
       (serves slow-elev1 f2)
       (serves slow-elev1 f3)
       (serves slow-elev1 f4)
       
       (serves slow-elev2 f4)
       (serves slow-elev2 f5)
       (serves slow-elev2 f6)
       (serves slow-elev2 f7)
       (serves slow-elev2 f8)

       (serves slow-elev3 f8)
       (serves slow-elev3 f9)
       (serves slow-elev3 f10)
       (serves slow-elev3 f11)
       (serves slow-elev3 f12)
       
       (serves fast-elev f0)
       (serves fast-elev f2)
       (serves fast-elev f4)
       (serves fast-elev f6)
       (serves fast-elev f8)
       (serves fast-elev f10)
       (serves fast-elev f12)

       (at-floor slow-elev1 f0)
       (at-floor slow-elev2 f4)
       (at-floor slow-elev3 f8)
       (at-floor fast-elev f0)
       )
  (:goal (and (at-floor p0 f3)
              (at-floor p1 f11)
              (at-floor p2 f12)
              (at-floor p3 f1)
              (at-floor p4 f9))))

; plan
1. (move---------------------- slow-elev1 f0 f2)
   deleted: (at-floor slow-elev1 f0)
   added: (at-floor slow-elev1 f2)
   goals met: 0 of 5
2. (get-in p1 slow-elev2 f4)
   deleted: (at-floor p1 f4)
   added: (at-elevator p1 slow-elev2)
   changed: (elevator-capacity slow-elev2) from 2 to 1
   goals met: 0 of 5
3. (get-in p0 slow-elev1 f2)
   deleted: (at-floor p0 f2)
   added: (at-elevator p0 slow-elev1)
   changed: (elevator-capacity slow-elev1) from 2 to 1
   goals met: 0 of 5
4. (move---------------------- slow-elev2 f4 f8)
   deleted: (at-floor slow-elev2 f4)
   added: (at-floor slow-elev2 f8)
   goals met: 0 of 5
5. (move---------------------- slow-elev1 f2 f3)
   deleted: (at-floor slow-elev1 f2)
   added: (at-floor slow-elev1 f3)
   goals met: 0 of 5
6. (get-out p1 slow-elev2 f8)
   deleted: (at-elevator p1 slow-elev2)
   added: (at-floor p1 f8)
   changed: (elevator-capacity slow-elev2) from 1 to 2
   goals met: 0 of 5
7. (get-out p0 slow-elev1 f3)
   deleted: (at-elevator p0 slow-elev1)
   added: (at-floor p0 f3)
   changed: (elevator-capacity slow-elev1) from 1 to 2
   goals met: 1 of 5
8. (get-in p1 slow-elev3 f8)
   deleted: (at-floor p1 f8)
   added: (at-elevator p1 slow-elev3)
   changed: (elevator-capacity slow-elev3) from 2 to 1
   goals met: 1 of 5
9. (get-in p3 slow-elev2 f8)
   deleted: (at-floor p3 f8)
   added: (at-elevator p3 slow-elev2)
   changed: (elevator-capacity slow-elev2) from 2 to 1
   goals met: 1 of 5
10. (move---------------------- slow-elev3 f8 f11)
   deleted: (at-floor slow-elev3 f8)
   added: (at-floor slow-elev3 f11)
   goals met: 1 of 5
11. (move---------------------- slow-elev1 f3 f4)
   deleted: (at-floor slow-elev1 f3)
   added: (at-floor slow-elev1 f4)
   goals met: 1 of 5
12. (move---------------------- slow-elev2 f8 f4)
   deleted: (at-floor slow-elev2 f8)
   added: (at-floor slow-elev2 f4)
   goals met: 1 of 5
13. (get-out p1 slow-elev3 f11)
   deleted: (at-elevator p1 slow-elev3)
   added: (at-floor p1 f11)
   changed: (elevator-capacity slow-elev3) from 1 to 2
   goals met: 2 of 5
14. (get-out p3 slow-elev2 f4)
   deleted: (at-elevator p3 slow-elev2)
   added: (at-floor p3 f4)
   changed: (elevator-capacity slow-elev2) from 1 to 2
   goals met: 2 of 5
15. (get-in p3 slow-elev1 f4)
   deleted: (at-floor p3 f4)
   added: (at-elevator p3 slow-elev1)
   changed: (elevator-capacity slow-elev1) from 2 to 1
   goals met: 2 of 5
16. (move---------------------- slow-elev3 f11 f12)
   deleted: (at-floor slow-elev3 f11)
   added: (at-floor slow-elev3 f12)
   goals met: 2 of 5
17. (move---------------------- slow-elev1 f4 f1)
   deleted: (at-floor slow-elev1 f4)
   added: (at-floor slow-elev1 f1)
   goals met: 2 of 5
18. (get-out p3 slow-elev1 f1)
   deleted: (at-elevator p3 slow-elev1)
   added: (at-floor p3 f1)
   changed: (elevator-capacity slow-elev1) from 1 to 2
   goals met: 3 of 5
19. (get-in p2 slow-elev1 f1)
   deleted: (at-floor p2 f1)
   added: (at-elevator p2 slow-elev1)
   changed: (elevator-capacity slow-elev1) from 2 to 1
   goals met: 3 of 5
20. (get-in p4 slow-elev1 f1)
   deleted: (at-floor p4 f1)
   added: (at-elevator p4 slow-elev1)
   changed: (elevator-capacity slow-elev1) from 1 to 0
   goals met: 3 of 5
21. (move---------------------- slow-elev1 f1 f0)
   deleted: (at-floor slow-elev1 f1)
   added: (at-floor slow-elev1 f0)
   goals met: 3 of 5
22. (get-out p4 slow-elev1 f0)
   deleted: (at-elevator p4 slow-elev1)
   added: (at-floor p4 f0)
   changed: (elevator-capacity slow-elev1) from 0 to 1
   goals met: 3 of 5
23. (get-out p2 slow-elev1 f0)
   deleted: (at-elevator p2 slow-elev1)
   added: (at-floor p2 f0)
   changed: (elevator-capacity slow-elev1) from 1 to 2
   goals met: 3 of 5
24. (get-in p2 fast-elev f0)
   deleted: (at-floor p2 f0)
   added: (at-elevator p2 fast-elev)
   changed: (elevator-capacity fast-elev) from 3 to 2
   goals met: 3 of 5
25. (get-in p4 fast-elev f0)
   deleted: (at-floor p4 f0)
   added: (at-elevator p4 fast-elev)
   changed: (elevator-capacity fast-elev) from 2 to 1
   goals met: 3 of 5
26. (move---------------------- fast-elev f0 f12)
   deleted: (at-floor fast-elev f0)
   added: (at-floor fast-elev f12)
   goals met: 3 of 5
27. (get-out p2 fast-elev f12)
   deleted: (at-elevator p2 fast-elev)
   added: (at-floor p2 f12)
   changed: (elevator-capacity fast-elev) from 1 to 2
   goals met: 4 of 5
28. (get-out p4 fast-elev f12)
   deleted: (at-elevator p4 fast-elev)
   added: (at-floor p4 f12)
   changed: (elevator-capacity fast-elev) from 2 to 3
   goals met: 4 of 5
29. (get-in p4 slow-elev3 f12)
   deleted: (at-floor p4 f12)
   added: (at-elevator p4 slow-elev3)
   changed: (elevator-capacity slow-elev3) from 2 to 1
   goals met: 4 of 5
30. (move---------------------- slow-elev3 f12 f9)
   deleted: (at-floor slow-elev3 f12)
   added: (at-floor slow-elev3 f9)
   goals met: 4 of 5
31. (get-out p4 slow-elev3 f9)
   deleted: (at-elevator p4 slow-elev3)
   added: (at-floor p4 f9)
   changed: (elevator-capacity slow-elev3) from 1 to 2
   goals met: 5 of 5
